In [4]:
import pandas as pd
import numpy as np

# Series

In [43]:
list1 = ['a', 'b', 'c', 'd','e']
labels = [1, 2, 3, 4, 5]

ser1 = pd.Series(data = list1, index = labels)  #Series will genarate 
ser1

1    a
2    b
3    c
4    d
5    e
dtype: object

In [7]:
arr = np.array([1, 2, 3, 4])
ser2 = pd.Series(arr)
ser2

0    1
1    2
2    3
3    4
dtype: int32

In [9]:
dict1 = {'fname' : 'data', 'l_name' : 'banas', 'age' : 25}
ser3 = pd.Series(dict1)
ser3

fname      data
l_name    banas
age          25
dtype: object

In [12]:
ser2 / ser2 #operators

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float64

In [13]:
np.exp(ser2)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

In [77]:
dict1 = {'Names':pd.Series(('Gopinath', 'Vagdevi','venkat','rushi','bharat'), index = [1, 2, 3, 4, 5]),
        'Marks' : pd.Series((95, 94, 99, 90, 85), index = [1, 2, 3, 4, 5])}

df2 = pd.DataFrame(dict1)
df2

      Names  Marks
1  Gopinath     95
2   Vagdevi     94
3    venkat     99
4     rushi     90
5    bharat     85

# DataFrame

In [111]:
arr2 = np.random.randint(10, 50, size = (2,3))
df = pd.DataFrame(arr2, ['A', 'B'],['D', 'E', 'F'])
df

    D   E   F
A  17  31  45
B  49  14  19

In [88]:
dict1 = {'one':pd.Series((1., 2., 3.), index = ['a', 'b', 'c']),
        'two' : pd.Series((1., 2., 3., 4.), index = ['a', 'b', 'c', 'd'])}

df2 = pd.DataFrame(dict1)
df2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [29]:
pd.DataFrame.from_dict(dict([('A',[1, 2, 3]), ('B', [2, 4, 6])]))

   A  B
0  1  2
1  2  4
2  3  6

In [31]:
pd.DataFrame.from_dict(dict([('A',[1, 2, 3]), ('B', [2, 4, 6])]), orient = 'index', columns = ['One', 'Two', 'Three'])

   One  Two  Three
A    1    2      3
B    2    4      6

In [36]:
df.shape

(2, 3)

# Editing & Retrieving Data

In [37]:
print(df)

    D   E   F
A  48  18  27
B  28  23  39

In [38]:
df['D']

A    48
B    28
Name: D, dtype: int32

In [40]:
df[['D','E']]

    D   E
A  48  18
B  28  23

In [41]:
df.loc['A']

D    48
E    18
F    27
Name: A, dtype: int32

In [42]:
df.iloc[1]

D    28
E    23
F    39
Name: B, dtype: int32

In [95]:
df

    D   E   F
A  41  41  48
B  26  14  48

In [80]:
df['Total'] = df['D'] + df['E'] + df['F']
df['total'] = df['A'] + df['B']
df

    D   E   F  Total
A  39  27  11     77
B  26  29  26     81

In [90]:

df2

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [92]:
df2['mul'] = df2['one'] * df2['two']
df2

   one  two  mul
a  1.0  1.0  1.0
b  2.0  2.0  4.0
c  3.0  3.0  9.0
d  NaN  4.0  NaN

In [113]:
dict4 = { 'D' : 33, 'E': 28, 'F': 30}
newRow = pd.Series(dict4, name = 'G')
df = df.append(newRow)

df

    D   E   F
A  17  31  45
B  49  14  19
G  33  28  30

In [105]:
df['Total'] = df['D'] + df['E'] + df ['F']
df

    D   E   F  Total
A  42  27  48    117
B  19  24  42     85
G  33  28  30     91

In [107]:
df.drop('Total', axis = 1, inplace = True)
df

    D   E   F
A  42  27  48
B  19  24  42
G  33  28  30

In [114]:
df['sex'] = ['Male', 'Female', 'other']
df.set_index('sex', inplace = False)
df

    D   E   F     sex
A  17  31  45    Male
B  49  14  19  Female
G  33  28  30   other